# EnergyAnalysisHvacSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisHvacSystem Property
ParameterTypeId Class See Also
---
"HVAC System"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisHvacSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisHvacSystem As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisHvacSystem {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace